## Plan Result (543: ithc_frontdoor - TerraformPlanApply)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 5 to add, 4 to change, 5 to destroy.</code></pre>

* Update
  * module.premium_front_door.azurerm_cdn_frontdoor_origin.front_door_origin[&#34;hmcts-courtfines-ithc&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_profile.front_door
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A[&#34;hmcts-courtfines-ithc&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_B[&#34;hmcts-courtfines-ithc&#34;]
* Replace
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain[&#34;hmcts-courtfines-ithc&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_A[&#34;hmcts-courtfines-ithc&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_B[&#34;hmcts-courtfines-ithc&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_security_policy.security_policy[&#34;hmcts-courtfines-ithc&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;hmcts-courtfines-ithc&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain["hmcts-courtfines-ithc"] must be replaced
-/+ resource "azurerm_cdn_frontdoor_custom_domain" "custom_domain" {
      ~ expiration_date          = "2025-07-08T17:35:36.2809675+00:00" -> (known after apply)
      ~ host_name                = "courtfines-app.ithc.apps.hmcts.net" -> "courtfines-app.ithc.platform.hmcts.net" # forces replacement
      ~ id                       = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/lz-ithc-rg/providers/Microsoft.Cdn/profiles/sdshmcts-ithc/customDomains/hmcts-courtfines-ithc" -> (known after apply)
        name                     = "hmcts-courtfines-ithc"
      ~ validation_token         = "_u517csusdjahqoworfy3j1vdv86yvrp" -> (known after apply)
        # (2 unchanged attributes hidden)

      ~ tls {
          + cdn_frontdoor_secret_id = (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_A["hmcts-courtfines-ithc"] must be replaced
-/+ resource "azurerm_cdn_frontdoor_custom_domain_association" "custom_association_A" {
      ~ cdn_frontdoor_custom_domain_id = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/lz-ithc-rg/providers/Microsoft.Cdn/profiles/sdshmcts-ithc/customDomains/hmcts-courtfines-ithc" -> (known after apply) # forces replacement
      ~ id                             = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/lz-ithc-rg/providers/Microsoft.Cdn/profiles/sdshmcts-ithc/associations/hmcts-courtfines-ithc" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_B["hmcts-courtfines-ithc"] must be replaced
-/+ resource "azurerm_cdn_frontdoor_custom_domain_association" "custom_association_B" {
      ~ cdn_frontdoor_custom_domain_id = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/lz-ithc-rg/providers/Microsoft.Cdn/profiles/sdshmcts-ithc/customDomains/hmcts-courtfines-ithc" -> (known after apply) # forces replacement
      ~ id                             = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/lz-ithc-rg/providers/Microsoft.Cdn/profiles/sdshmcts-ithc/associations/hmcts-courtfines-ithc" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_origin.front_door_origin["hmcts-courtfines-ithc"] will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_origin" "front_door_origin" {
        id                             = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/lz-ithc-rg/providers/Microsoft.Cdn/profiles/sdshmcts-ithc/originGroups/hmcts-courtfines-ithc/origins/hmcts-courtfines-ithc"
        name                           = "hmcts-courtfines-ithc"
      ~ origin_host_header             = "courtfines-app.ithc.apps.hmcts.net" -> "courtfines-app.ithc.platform.hmcts.net"
        # (8 unchanged attributes hidden)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_profile.front_door will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_profile" "front_door" {
        id                       = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/lz-ithc-rg/providers/Microsoft.Cdn/profiles/sdshmcts-ithc"
        name                     = "sdshmcts-ithc"
        tags                     = {
            "application"  = "core"
            "builtFrom"    = "hmcts/sds-azure-platform"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "Medium"
            "environment"  = "ithc"
        }
        # (4 unchanged attributes hidden)

      - identity {
          - identity_ids = [] -> null
          - principal_id = "abab5c8f-3705-4721-a408-ad930c37eacb" -> null
          - tenant_id    = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> null
          - type         = "SystemAssigned" -> null
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A["hmcts-courtfines-ithc"] will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_route" "routing_rule_A" {
      ~ cdn_frontdoor_custom_domain_ids = [
          - "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/lz-ithc-rg/providers/Microsoft.Cdn/profiles/sdshmcts-ithc/customDomains/hmcts-courtfines-ithc",
        ] -> (known after apply)
        id                              = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/lz-ithc-rg/providers/Microsoft.Cdn/profiles/sdshmcts-ithc/afdEndpoints/sdshmcts-ithc/routes/hmcts-courtfines-ithc"
        name                            = "hmcts-courtfines-ithc"
        # (11 unchanged attributes hidden)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_B["hmcts-courtfines-ithc"] will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_route" "routing_rule_B" {
      ~ cdn_frontdoor_custom_domain_ids = [
          - "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/lz-ithc-rg/providers/Microsoft.Cdn/profiles/sdshmcts-ithc/customDomains/hmcts-courtfines-ithc",
        ] -> (known after apply)
        id                              = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/lz-ithc-rg/providers/Microsoft.Cdn/profiles/sdshmcts-ithc/afdEndpoints/sdshmcts-ithc/routes/hmcts-courtfines-ithcHttpsRedirect"
        name                            = "hmcts-courtfines-ithcHttpsRedirect"
        # (11 unchanged attributes hidden)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_security_policy.security_policy["hmcts-courtfines-ithc"] must be replaced
-/+ resource "azurerm_cdn_frontdoor_security_policy" "security_policy" {
      ~ id                       = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/lz-ithc-rg/providers/Microsoft.Cdn/profiles/sdshmcts-ithc/securityPolicies/hmctscourtfinesithcithcPremium-securityPolicy" -> (known after apply)
        name                     = "hmctscourtfinesithcithcPremium-securityPolicy"
        # (1 unchanged attribute hidden)

      ~ security_policies {
          ~ firewall {
                # (1 unchanged attribute hidden)

              ~ association {
                    # (1 unchanged attribute hidden)

                  ~ domain {
                      ~ active                  = false -> (known after apply)
                      ~ cdn_frontdoor_domain_id = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/lz-ithc-rg/providers/Microsoft.Cdn/profiles/sdshmcts-ithc/customDomains/hmcts-courtfines-ithc" -> (known after apply) # forces replacement
                    }
                }
            }
        }
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["hmcts-courtfines-ithc"] must be replaced
-/+ resource "azurerm_dns_txt_record" "public_dns_record" {
      ~ fqdn                = "_dnsauth.courtfines-app.ithc.apps.hmcts.net." -> (known after apply)
      ~ id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformmgmtrg/providers/Microsoft.Network/dnsZones/apps.hmcts.net/TXT/_dnsauth.courtfines-app.ithc" -> (known after apply)
      ~ name                = "_dnsauth.courtfines-app.ithc" -> "_dnsauth.courtfines-app" # forces replacement
      - tags                = {} -> null
      ~ zone_name           = "apps.hmcts.net" -> "ithc.platform.hmcts.net" # forces replacement
        # (2 unchanged attributes hidden)

      - record {
          - value = "_u517csusdjahqoworfy3j1vdv86yvrp" -> null
        }
      + record {
          + value = (known after apply)
        }
    }

Plan: 5 to add, 4 to change, 5 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":951,"Program":"tfcmt","SHA1":"","Target":"543: ithc_frontdoor - TerraformPlanApply","Vars":{}} -->